In [1]:
import pandas as pd
from sqlalchemy import create_engine
from config import portgres_pw, postgres_user

In [2]:
characters_data = "disney-characters.csv"
characters_df = pd.read_csv(characters_data)
characters_df.head()

,movie_title,release_date,hero,villian,song
0,\r\nSnow White and the Seven Dwarfs,"December 21, 1937",Snow White,Evil Queen,Some Day My Prince Will Come
1,\r\nPinocchio,"February 7, 1940",Pinocchio,Stromboli,When You Wish upon a Star
2,\r\nFantasia,"November 13, 1940",NaN,Chernabog,NaN
3,Dumbo,"October 23, 1941",Dumbo,Ringmaster,Baby Mine
4,\r\nBambi,"August 13, 1942",Bambi,Hunter,Love Is a Song

In [3]:
director_data = "disney-director.csv"
director_df = pd.read_csv(director_data)
director_df.head()

                              name        director
0  Snow White and the Seven Dwarfs      David Hand
1                        Pinocchio  Ben Sharpsteen
2                         Fantasia    full credits
3                            Dumbo  Ben Sharpsteen
4                            Bambi      David Hand

In [4]:
movies_data = "disney_movies_total_gross.csv"
movies_df = pd.read_csv(movies_data)
movies_df.head()

,movie_title,release_date,genre,MPAA_rating,total_gross,inflation_adjusted_gross
0,Snow White and the Seven Dwarfs,"Dec 21, 1937",Musical,G,"$184,925,485","$5,228,953,251"
1,Pinocchio,"Feb 9, 1940",Adventure,G,"$84,300,000","$2,188,229,052"
2,Fantasia,"Nov 13, 1940",Musical,G,"$83,320,000","$2,187,090,808"
3,Song of the South,"Nov 12, 1946",Adventure,G,"$65,000,000","$1,078,510,579"
4,Cinderella,"Feb 15, 1950",Drama,G,"$85,000,000","$920,608,730"

In [5]:
characters_data = "disney-characters.csv"
characters_df = pd.read_csv(characters_data)

characters_df = characters_df.rename(columns={"movie_title": "Movie_Title", "release_date": "Release_Date", "hero": "Hero", "villian": "Villain", "song": "Song"}, errors="raise")
characters_df.head()

,Movie_Title,Release_Date,Hero,Villain,Song
0,\r\nSnow White and the Seven Dwarfs,"December 21, 1937",Snow White,Evil Queen,Some Day My Prince Will Come
1,\r\nPinocchio,"February 7, 1940",Pinocchio,Stromboli,When You Wish upon a Star
2,\r\nFantasia,"November 13, 1940",NaN,Chernabog,NaN
3,Dumbo,"October 23, 1941",Dumbo,Ringmaster,Baby Mine
4,\r\nBambi,"August 13, 1942",Bambi,Hunter,Love Is a Song

In [6]:
director_data = "disney-director.csv"
director_df = pd.read_csv(director_data)
#Rename columns for better readability
director_df = director_df.rename(columns={"name": "Movie_Title", "director": "Director"}, errors="raise")
director_df.head()

                       Movie_Title        Director
0  Snow White and the Seven Dwarfs      David Hand
1                        Pinocchio  Ben Sharpsteen
2                         Fantasia    full credits
3                            Dumbo  Ben Sharpsteen
4                            Bambi      David Hand

In [7]:
# Load in Disney movie dataset
movies_data = "disney_movies_total_gross.csv"
movies_df = pd.read_csv(movies_data)
#Rename columns for better readability
movies_df = movies_df.rename(columns={"movie_title": "Movie_Title", "release_date": "Release_Date", "genre": "Genre", "MPAA_rating": "MPAA_Rating", "total_gross": "Total_Gross", "inflation_adjusted_gross": "Inflation_Adjusted_Gross"}, errors="raise")
movies_df.head()

,Movie_Title,Release_Date,Genre,MPAA_Rating,Total_Gross,Inflation_Adjusted_Gross
0,Snow White and the Seven Dwarfs,"Dec 21, 1937",Musical,G,"$184,925,485","$5,228,953,251"
1,Pinocchio,"Feb 9, 1940",Adventure,G,"$84,300,000","$2,188,229,052"
2,Fantasia,"Nov 13, 1940",Musical,G,"$83,320,000","$2,187,090,808"
3,Song of the South,"Nov 12, 1946",Adventure,G,"$65,000,000","$1,078,510,579"
4,Cinderella,"Feb 15, 1950",Drama,G,"$85,000,000","$920,608,730"

In [8]:
characters_df['Movie_Title'] = characters_df['Movie_Title'].map(lambda x: x.lstrip('\r\n'))
characters_df.head()

,Movie_Title,Release_Date,Hero,Villain,Song
0,Snow White and the Seven Dwarfs,"December 21, 1937",Snow White,Evil Queen,Some Day My Prince Will Come
1,Pinocchio,"February 7, 1940",Pinocchio,Stromboli,When You Wish upon a Star
2,Fantasia,"November 13, 1940",NaN,Chernabog,NaN
3,Dumbo,"October 23, 1941",Dumbo,Ringmaster,Baby Mine
4,Bambi,"August 13, 1942",Bambi,Hunter,Love Is a Song

In [13]:
pip install psycopg2

Collecting psycopg2
  Downloading https://files.pythonhosted.org/packages/1a/85/853f11abfccfd581b099e5ae5f2dd807cc2919745b13d14e565022fd821c/psycopg2-2.8.4-cp37-cp37m-win_amd64.whl (1.1MB)
Installing collected packages: psycopg2
Successfully installed psycopg2-2.8.4
Note: you may need to restart the kernel to use updated packages.

In [9]:
rds_connection_string = (f"{postgres_user}:{portgres_pw}" 
                         + "@localhost:5432/disney_db")
engine = create_engine(f'postgresql://{rds_connection_string}')

In [11]:
engine.table_names()

['characters', 'directors', 'movies']

In [12]:
characters_df.to_sql(name="characters", con=engine,
                  if_exists="append", index=False)

In [13]:
director_df.to_sql(name="directors", con=engine,
                  if_exists="append", index=False)

In [15]:
movies_df.to_sql(name="movies", con=engine,
                  if_exists="append", index=False)